
## Plan Result (prod)




<pre><code>Plan: 15 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Contributor&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Data Reader&#34;]
  * module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this[&#34;Storage Blob Delegator&#34;]
* Update
  * azurerm_resource_group.rg


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod"
        name       = "rd-prod"
      ~ tags       = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "production"
          - "lastUpdated"         = "2025-02-19T20:30:44Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_commondata.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdcommondataprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_data_extract.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rddataextractprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_location.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdlocationprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Contributor"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Data Reader"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

  # module.storage_account_rd_professional.azurerm_pim_eligible_role_assignment.this["Storage Blob Delegator"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "this" {
      + id                 = (known after apply)
      + justification      = (known after apply)
      + principal_id       = "f0a367e1-7e08-42b5-81e4-c848787e6f1e"
      + principal_type     = (known after apply)
      + role_definition_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/db58b8e5-c6ad-4a2a-8342-4190687cbf4a"
      + scope              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.Storage/storageAccounts/rdprofessionalprod"

      + schedule {
          + start_date_time = "2023-11-17T11:13:01Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2026-01-03T10:20:49Z"
            }
        }

      + ticket (known after apply)
    }

Plan: 15 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":276,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->